; domain
(define (domain delivery)
  (:requirements :strips :typing)

  (:types
    agent package location - object
  )

  (:predicates
    (at ?a - agent ?l - location)
    (has ?a - agent ?p - package)
    (in ?p - package ?l - location)
    (connected ?from - location ?to - location)
    (requested ?p - package ?dest - location)
    (delivered ?p - package)
    (available ?a - agent)
  )

  (:action pick-up
    :parameters (?a - agent ?p - package ?l - location)
    :precondition (and (at ?a ?l) (in ?p ?l) (available ?a))
    :effect (and 
              (has ?a ?p)
              (not (in ?p ?l))
            )
  )

  (:action move
    :parameters (?a - agent ?from - location ?to - location)
    :precondition (and (at ?a ?from) (connected ?from ?to) (available ?a))
    :effect (and 
              (at ?a ?to)
              (not (at ?a ?from)))
  )

  (:action drop-off
    :parameters (?a - agent ?p - package ?l - location)
    :precondition (and (has ?a ?p) (at ?a ?l) (requested ?p ?l))
    :effect (and 
              (delivered ?p)
              (in ?p ?l)
              (not (has ?a ?p)))
            )
  )

; problem
(define (problem delivery-relay)
  (:domain delivery)
  (:objects
    robotA robotB - agent
    pkgX - package
    locX locY locZ - location
  )
  (:init
    (at robotA locX)
    (at robotB locZ)
    (in pkgX locX)
    (connected locX locY)
    (connected locY locZ)
    (requested pkgX locZ)
    (available robotA) ; Robot A is available for actions
    (available robotB) ; Robot B is available for actions
  )
  (:goal (delivered pkgX))
)

; plan
1. (pick-up robota pkgx locx)
   deleted: (in pkgx locx)
   added: (has robota pkgx)
   goals met: 0 of 1
2. (move robota locx locy)
   deleted: (at robota locx)
   added: (at robota locy)
   goals met: 0 of 1
3. (move robota locy locz)
   deleted: (at robota locy)
   added: (at robota locz)
   goals met: 0 of 1
4. (drop-off robota pkgx locz)
   deleted: (has robota pkgx)
   added: (delivered pkgx) (in pkgx locz)
   goals met: 1 of 1
